# 'brew tap'
tap "homebrew/cask"
# 'brew tap' with custom Git URL
tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git"
# 'brew tap' with arguments
tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git", force_auto_update: true

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# 'brew install'
brew "imagemagick"
# 'brew install --with-rmtp', 'brew services restart' on version changes
brew "denji/nginx/nginx-full", args: ["with-rmtp"], restart_service: :changed
# 'brew install', always 'brew services restart', 'brew link', 'brew unlink mysql' (if it is installed)
brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysql"]
# install only on specified OS
brew "gnupg" if OS.mac?
brew "glibc" if OS.linux?

# 'brew install --cask'
cask "google-chrome"
# 'brew install --cask --appdir=~/my-apps/Applications'
cask "firefox", args: { appdir: "~/my-apps/Applications" }
# bypass Gatekeeper protections (NOT RECOMMENDED)
cask "firefox", args: { no_quarantine: true }
# always upgrade auto-updated or unversioned cask to latest version even if already installed
cask "opera", greedy: true
# 'brew install --cask' only if '/usr/libexec/java_home --failfast' fails
cask "java" unless system "/usr/libexec/java_home --failfast"

# 'mas install'
mas "1Password", id: 443987910

# 'whalebrew install'
whalebrew "whalebrew/wget"









tap "caarlos0/tap"
tap "drud/ddev"
tap "heroku/brew"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
tap "thoughtbot/formulae"
brew "autoconf"
brew "aws-cdk"
brew "readline"
brew "xz"
brew "awscli"
brew "libpng"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "chezmoi"
brew "cmatrix"
brew "dvm"
brew "fd"
brew "fzf"
brew "gh"
brew "giflib"
brew "git"
brew "git-lfs"
brew "glow"
brew "gnutls"
brew "gnupg"
brew "harfbuzz"
brew "jenv"
brew "jpeg", link: true
brew "jq"
brew "pango"
brew "librsvg"
brew "mas"
brew "mongosh"
brew "zlib"
brew "mysql-client"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "perl"
brew "prettier"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "wget"
brew "caarlos0/tap/timer"
brew "mongodb/brew/mongodb-database-tools"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "docker"
cask "font-blex-mono-nerd-font"
cask "gpg-suite"
cask "kitty"
cask "prismlauncher"
cask "xquartz"
mas "LanScan", id: 472226235
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Speedtest", id: 1153157709
